----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             896
       BatchNorm2d-2         [-1, 32, 112, 112]              64
         LeakyReLU-3         [-1, 32, 112, 112]               0
            Conv2d-4           [-1, 64, 56, 56]          18,496
       BatchNorm2d-5           [-1, 64, 56, 56]             128
         LeakyReLU-6           [-1, 64, 56, 56]               0
            Conv2d-7          [-1, 128, 28, 28]          73,856
       BatchNorm2d-8          [-1, 128, 28, 28]             256
         LeakyReLU-9          [-1, 128, 28, 28]               0
           Conv2d-10          [-1, 256, 14, 14]         295,168
      BatchNorm2d-11          [-1, 256, 14, 14]             512
        LeakyReLU-12          [-1, 256, 14, 14]               0
           Conv2d-13            [-1, 512, 7, 7]       1,180,160
      BatchNorm2d-14            [-1, 512, 7, 7]           1,024
        LeakyReLU-15            [-1, 512, 7, 7]               0
           Linear-16                   [-1, 10]         250,890
           Linear-17                   [-1, 10]         250,890
           Linear-18                [-1, 25088]         275,968
  ConvTranspose2d-19          [-1, 256, 14, 14]       1,179,904
      BatchNorm2d-20          [-1, 256, 14, 14]             512
        LeakyReLU-21          [-1, 256, 14, 14]               0
  ConvTranspose2d-22          [-1, 128, 28, 28]         295,040
      BatchNorm2d-23          [-1, 128, 28, 28]             256
        LeakyReLU-24          [-1, 128, 28, 28]               0
  ConvTranspose2d-25           [-1, 64, 56, 56]          73,792
      BatchNorm2d-26           [-1, 64, 56, 56]             128
        LeakyReLU-27           [-1, 64, 56, 56]               0
  ConvTranspose2d-28         [-1, 32, 112, 112]          18,464
      BatchNorm2d-29         [-1, 32, 112, 112]              64
        LeakyReLU-30         [-1, 32, 112, 112]               0
  ConvTranspose2d-31         [-1, 32, 224, 224]           9,248
      BatchNorm2d-32         [-1, 32, 224, 224]              64
        LeakyReLU-33         [-1, 32, 224, 224]               0
           Conv2d-34          [-1, 3, 224, 224]             867
             Tanh-35          [-1, 3, 224, 224]               0
================================================================
Total params: 3,926,647
Trainable params: 3,926,647
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 74.27
Params size (MB): 14.98
Estimated Total Size (MB): 89.82
----------------------------------------------------------------
None
